/*
Развлекаемся с суммой
Реализуйте функцию, возвращающую сумму двух чисел.
 Менять сигнатуру функции не нужно.
 Писать что то кроме функции - не нужно!
 Задумываться о вводе тоже не нужно!

Sample Input 1:

8 11
Sample Output 1:

19
*/

import java.util.Scanner;

public class Task1{

    static int sum(int a, int b){

        int sum = a + b;

        System.out.print(sum);
        return sum;
    }
}